In [1]:
import numpy as np
import pandas as pd

In [2]:
registrations = pd.DataFrame({'reg_id': [1,2,3,4], 'name': ['Andrew','Bobo', 'Claire', 'Dvaid']})
logins = pd.DataFrame({'log_id': [1, 2, 3, 4], 'name': ['Xavier', 'Andrew', 'Yolanda', 'Bobo']})

In [3]:
registrations

   reg_id    name
0       1  Andrew
1       2    Bobo
2       3  Claire
3       4   Dvaid

In [4]:
logins

   log_id     name
0       1   Xavier
1       2   Andrew
2       3  Yolanda
3       4     Bobo

In [5]:
pd.merge(registrations, logins, how='outer', on='name')

   reg_id     name  log_id
0     1.0   Andrew     2.0
1     2.0     Bobo     4.0
2     3.0   Claire     NaN
3     4.0    Dvaid     NaN
4     NaN   Xavier     1.0
5     NaN  Yolanda     3.0

In [7]:
pd.merge(logins, registrations, how='outer', on='name')

   log_id     name  reg_id
0     1.0   Xavier     NaN
1     2.0   Andrew     1.0
2     3.0  Yolanda     NaN
3     4.0     Bobo     2.0
4     NaN   Claire     3.0
5     NaN    Dvaid     4.0

In [8]:
registrations = registrations.set_index('name')

In [9]:
registrations

        reg_id
name
Andrew       1
Bobo         2
Claire       3
Dvaid        4

In [10]:
pd.merge(registrations, logins, left_index=True, right_on='name')

   reg_id  log_id    name
1       1       2  Andrew
3       2       4    Bobo

In [11]:
registrations

        reg_id
name
Andrew       1
Bobo         2
Claire       3
Dvaid        4

In [12]:
registrations.reset_index()

     name  reg_id
0  Andrew       1
1    Bobo       2
2  Claire       3
3   Dvaid       4

In [13]:
registrations = registrations.reset_index()

In [14]:
registrations

     name  reg_id
0  Andrew       1
1    Bobo       2
2  Claire       3
3   Dvaid       4

In [15]:
registrations.columns = ['reg_name', 'reg_id']

In [16]:
registrations

  reg_name  reg_id
0   Andrew       1
1     Bobo       2
2   Claire       3
3    Dvaid       4

In [17]:
pd.merge(registrations, logins, how='inner', left_on='reg_name', right_on='name')

  reg_name  reg_id  log_id    name
0   Andrew       1       2  Andrew
1     Bobo       2       4    Bobo

In [18]:
results = pd.merge(registrations, logins, how='inner', left_on='reg_name', right_on='name')

In [19]:
results

  reg_name  reg_id  log_id    name
0   Andrew       1       2  Andrew
1     Bobo       2       4    Bobo

In [20]:
results = results.drop('reg_name', axis=1)

In [21]:
results

   reg_id  log_id    name
0       1       2  Andrew
1       2       4    Bobo

In [22]:
registrations

  reg_name  reg_id
0   Andrew       1
1     Bobo       2
2   Claire       3
3    Dvaid       4

In [23]:
registrations.columns = ['name', 'id']

In [24]:
logins

   log_id     name
0       1   Xavier
1       2   Andrew
2       3  Yolanda
3       4     Bobo

In [25]:
logins.columns = ['id', 'name']

In [26]:
registrations

     name  id
0  Andrew   1
1    Bobo   2
2  Claire   3
3   Dvaid   4

In [27]:
logins

   id     name
0   1   Xavier
1   2   Andrew
2   3  Yolanda
3   4     Bobo

In [28]:
pd.merge(registrations, logins, how='inner', on='name')

     name  id_x  id_y
0  Andrew     1     2
1    Bobo     2     4

In [30]:
pd.merge(registrations, logins, how='inner', on='name', suffixes=('_reg', '_log'))

     name  id_reg  id_log
0  Andrew       1       2
1    Bobo       2       4